# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

### Load Required Libraries

In [1]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [5]:
connection = mysql.connector.connect(host="localhost",user="root",passwd="vk1997")

cursorObject = connection.cursor()

### You are required to create a database named 'e_commerce'

In [6]:
cursorObject.execute("create database e_commerce")

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [7]:
connection.close()

In [9]:
connection = mysql.connector.connect(host="localhost",user="root",passwd="Vk1997",database="e_commerce")
cursorObject = connection.cursor()

In [11]:
#Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


#Ans1.
table_qry="""
    create table supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10));
    
    create table customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), 
    CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));
    
    create table category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));
    
    create table product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, 
    CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));
    
    create table product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, 
    PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));
    
    create table e_commerce.order(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, 
    PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),
    FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
    
    create table rating (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,
    PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));

"""

cursorObject.execute(table_qry)

In [12]:
connection.close()

In [13]:
connection = mysql.connector.connect(host="localhost",user="root",passwd="Vk1997",database="e_commerce")
cursorObject = connection.cursor()

# Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_Nimport mysql.connector
import pandas as pdAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [15]:
#Q2. Insert the following data in the table created above

#Ans2. 
insert_supplier="""
    insert into supplier(supp_id, supp_name, supp_city, supp_phone) values (%s,%s,%s,%s)
"""
val = [(1,'Rajesh Retails','Delhi','1234567890'),
        (2,'Appario Ltd.','Mumbai','2589631470'),
        (3,'Knome products','Bangalore','9785462315'),
       (4, 'Bansal Retails','Kochi','8975463285'),
       (5,'Mittal Ltd.','Lucknow','7898456532')
]

cursorObject.executemany(insert_supplier,val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [17]:
# insert into "customer" table
insert_customer="""
    insert into customer(CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER)
    values(%s,%s,%s,%s,%s)
"""
val=[
    (1,'AAKASH','9999999999','DELHI','M'),
    (2,'AMAN','9785463215','NOIDA','M'),
    (3,'NEHA','9999999998','MUMBAI','F'),
    (4,'MEGHA','9994562399','KOLKATA','F'),
    (5,'PULKIT','7895999999','LUCKNOW','M')
]

cursorObject.executemany(insert_customer,val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [19]:
# insert into "categoty" table
insert_category="""
    insert into category(CAT_ID,CAT_NAME)
    values(%s,%s)
"""
val=[
    (1,'BOOKS'),
    (2,'GAMES'),
    (3,'GROCERIES'),
    (4,'ELECTRONICS'),
    (5,'CLOTHES')
]
cursorObject.executemany(insert_category,val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [20]:
# insert into "product" table
insert_product="""
    insert into product(PRO_ID,PRO_NAME,PRO_DESC,CAT_ID) 
    values(%s,%s,%s,%s)
    
"""
val=[
        (1,'GTA V','DFJDJFDJFDJFDJFJF',2),
    (2,'TSHIRT','DFDFJDFJDKFD',5),
    (3,'ROG LAPTOP','DFNTTNTNTERND',4),
    (4,'OATS','REURENTBTOTH',3),
    (5,'HARRY POTTER','NBEMCTHTJTH',1)
]
cursorObject.executemany(insert_product,val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [21]:
# insert into "product_details" table
insert_product_details="""
    insert into product_details(PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE)
    values(%s,%s,%s,%s)
"""
val=[
    (1,1,2,1500),
    (2,3,5,30000),
    (3,5,1,3000),
    (4,2,3,2500),
    (5,4,1,1000)
]
cursorObject.executemany(insert_product_details,val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [35]:
# insert into "orders" table
insert_orders="""
    insert into order(ORD_ID,ORD_AMOUNT,ORD_DATE,CUST_ID,PROD_ID)
    values(%s,%s,%s,%s,%s)
"""
val=[
    (20,1500,"2021-10-12",3,5),
    (25,30500,"2021-09-16",5,2),
    (26,2000,"2021-10-05",1,1),
    (30,3500,"2021-08-16",4,3),
    (50,2000,"2021-10-06",2,1)
]
cursorObject.executemany(insert_orders,val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [33]:
# insert into "rating" table
insert_rating="""
insert into rating(RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) values(%s,%s,%s,%s)
"""
val=[
    ( 1,2,2,4),
    (2,3,4,3),
    (3, 5, 1, 5),
    (4, 1, 3, 2),
    (5, 4, 5, 4)
]

cursorObject.executemany(insert_rating,val)
connection.commit()

In [47]:
def select_records(table):
    qry="""select * from """ + table
    print(qry)
    cursorObject.execute(qry)
    output=cursorObject.fetchall()
    print(output)
    output_df=pd.DataFrame(output)
    print(output_df)

In [48]:
select_records("supplier")
#supp_id, supp_name, supp_city, supp_phone

select * from supplier
[(1, 'Rajesh Retails', 'Delhi', '1234567890'), (2, 'Appario Ltd.', 'Mumbai', '2589631470'), (3, 'Knome products', 'Bangalore', '9785462315'), (4, 'Bansal Retails', 'Kochi', '8975463285'), (5, 'Mittal Ltd.', 'Lucknow', '7898456532')]
   0               1          2           3
0  1  Rajesh Retails      Delhi  1234567890
1  2    Appario Ltd.     Mumbai  2589631470
2  3  Knome products  Bangalore  9785462315
3  4  Bansal Retails      Kochi  8975463285
4  5     Mittal Ltd.    Lucknow  7898456532

In [49]:
select_records("customer")
#CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER

select * from customer
[(1, 'AAKASH', '9999999999', 'DELHI', 'M'), (2, 'AMAN', '9785463215', 'NOIDA', 'M'), (3, 'NEHA', '9999999998', 'MUMBAI', 'F'), (4, 'MEGHA', '9994562399', 'KOLKATA', 'F'), (5, 'PULKIT', '7895999999', 'LUCKNOW', 'M')]
   0       1           2        3  4
0  1  AAKASH  9999999999    DELHI  M
1  2    AMAN  9785463215    NOIDA  M
2  3    NEHA  9999999998   MUMBAI  F
3  4   MEGHA  9994562399  KOLKATA  F
4  5  PULKIT  7895999999  LUCKNOW  M

In [50]:
select_records("category")
#CAT_ID,CAT_NAME

select * from category
[(1, 'BOOKS'), (2, 'GAMES'), (3, 'GROCERIES'), (4, 'ELECTRONICS'), (5, 'CLOTHES')]
   0            1
0  1        BOOKS
1  2        GAMES
2  3    GROCERIES
3  4  ELECTRONICS
4  5      CLOTHES

In [51]:
select_records("product")
#PRO_ID,PRO_NAME,PRO_DESC,CAT_ID

select * from product
[(1, 'GTA V', 'DFJDJFDJFDJFDJFJF', 2), (2, 'TSHIRT', 'DFDFJDFJDKFD', 5), (3, 'ROG LAPTOP', 'DFNTTNTNTERND', 4), (4, 'OATS', 'REURENTBTOTH', 3), (5, 'HARRY POTTER', 'NBEMCTHTJTH', 1)]
   0             1                  2  3
0  1         GTA V  DFJDJFDJFDJFDJFJF  2
1  2        TSHIRT       DFDFJDFJDKFD  5
2  3    ROG LAPTOP      DFNTTNTNTERND  4
3  4          OATS       REURENTBTOTH  3
4  5  HARRY POTTER        NBEMCTHTJTH  1

In [52]:
select_records("product_details")
#PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE

select * from product_details
[(1, 1, 2, 1500), (2, 3, 5, 30000), (3, 5, 1, 3000), (4, 2, 3, 2500), (5, 4, 1, 1000)]
   0  1  2      3
0  1  1  2   1500
1  2  3  5  30000
2  3  5  1   3000
3  4  2  3   2500
4  5  4  1   1000

In [56]:
select_records("e_commerce.order")
#ORD_ID,ORD_AMOUNT,ORD_DATE,CUST_ID,PROD_ID

select * from e_commerce.order
[(20, 1500, datetime.date(2021, 10, 12), 3, 5), (25, 30500, datetime.date(2021, 9, 16), 5, 2), (26, 2000, datetime.date(2021, 10, 5), 1, 1), (30, 3500, datetime.date(2021, 8, 16), 4, 3), (50, 2000, datetime.date(2021, 10, 6), 2, 1)]
    0      1           2  3  4
0  20   1500  2021-10-12  3  5
1  25  30500  2021-09-16  5  2
2  26   2000  2021-10-05  1  1
3  30   3500  2021-08-16  4  3
4  50   2000  2021-10-06  2  1

In [57]:
select_records("rating")
#RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS

select * from rating
[(1, 2, 2, 4), (2, 3, 4, 3), (3, 5, 1, 5), (4, 1, 3, 2), (5, 4, 5, 4)]
   0  1  2  3
0  1  2  2  4
1  2  3  4  3
2  3  5  1  5
3  4  1  3  2
4  5  4  5  4

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [117]:
#Q3) Display the number of the customer group by their genders who have placed any 
#order of amount greater than or equal to Rs.3000.

#Ans3.
qry="""
    select a.cus_gender, count(*) from
    (select c.cus_gender,o.ord_amount,o.cust_id from customer as c 
    inner join e_commerce.order as o on o.cust_id = c.cus_id where o.ord_amount >= 3000) 
    as a group by a.cus_gender
"""

cursorObject.execute(qry)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['Gender','Count'])
output_df

  Gender  Count
0      M      1
1      F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [110]:
#Ans.4
qry="""
    select o.ord_id,o.ord_amount, o.ord_date, o.cust_id, o.prod_id, p.pro_name from e_commerce.order
    as o inner join product as p on p.pro_id = o.prod_id where o.cust_id = 2
"""

cursorObject.execute(qry)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['Order Id','Order Amt','Order Date','Customer Id','Product Id','Product Name'])
output_df

   Order Id  Order Amt  Order Date  Customer Id  Product Id Product Name
0        50       2000  2021-10-06            2           1        GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [109]:
#Q5) Display the Supplier details who can supply more than one product.

#Ans5.
qry="""
    select s.supp_id, s.supp_name, s.supp_city, s.supp_phone from supplier as s
    inner join product_details as p on p.supp_id = s.supp_id having count(s.supp_id) > 1
"""

cursorObject.execute(qry)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['Supplier Id','Supplier Name','City','Phone Number'])
output_df

   Supplier Id   Supplier Name   City Phone Number
0            1  Rajesh Retails  Delhi   1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [87]:
#Ans6.
qry="""
    select min(a.cat_name) from e_commerce.order as o inner join
    (select p.pro_id,c.cat_id,c.cat_name from product as p inner join category as c on c.cat_id = p.cat_id)
    as a on a.pro_id = o.prod_id
"""
cursorObject.execute(qry)
output=cursorObject.fetchall()
output_df=pd.DataFrame(output,columns=['Category of Min Order'])
output_df

  Category of Min Order
0                 BOOKS

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [81]:
#Ans7.
qry="""
    select pro_id,pro_name from product where pro_id in
    (select prod_id from e_commerce.order where ord_date > "2021-10-05") 
"""

cursorObject.execute(qry)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['Product Id','Product Name'])
output_df

   Product Id  Product Name
0           1         GTA V
1           5  HARRY POTTER

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [104]:
#Ans8.
qry="""
    select s.supp_name,r.supp_id,r.rat_ratstars,c.cus_name from rating as r 
    inner join customer as c on c.cus_id = r.cus_id 
    inner join supplier as s on s.supp_id = r.supp_id 
    order by r.rat_ratstars desc limit 3
"""

cursorObject.execute(qry)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['Supplier Name','Supplier Id','Rating','Rating By Customer'])
output_df

    Supplier Name  Supplier Id  Rating Rating By Customer
0  Rajesh Retails            1       5             PULKIT
1    Appario Ltd.            2       4               AMAN
2     Mittal Ltd.            5       4              MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [76]:
#Ans9.
qry="""
    select cus_name, cus_gender from customer where cus_name like 'a%' or cus_name like '%a'
"""

cursorObject.execute(qry)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['Customer Name','Customer Gender'])
output_df

  Customer Name Customer Gender
0        AAKASH               M
1          AMAN               M
2          NEHA               F
3         MEGHA               F

### Q10) Display the total order amount of the male customers.

In [73]:
#Ans10.
qry="""
    select sum(o.ord_amount) from e_commerce.order as o inner join  
    (select cus_id from customer where cus_gender = 'M') as c on c.cus_id = o.cust_id
"""

cursorObject.execute(qry)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['TOT_ORD_AMT'])
output_df

  TOT_ORD_AMT
0       34500

### Q11) Display all the Customers left outer join with  the orders

In [62]:
#Ans11.
qry="""
    select * from customer as c left outer join e_commerce.Order as O on O.cust_id = c.cus_id 
"""

cursorObject.execute(qry)
output = cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER','ORD_ID','ORD_AMOUNT','ORD_DATE','CUST_ID','PROD_ID']) 
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUST_ID,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2

In [118]:
connection.close()
#Completed

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)